{
  "HET_ID": {
    "descripcion": "Identificador único de cada registro en el historial de cambios de estado de una tarjeta. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Auditoría y Compliance": {
        "proposito": "Rastreo de cambios en el estado de las tarjetas para auditorías internas y externas, y cumplimiento de normativas.",
        "reporteria_bi": "Informes de trazabilidad de estados de tarjeta, registros de auditoría."
      },
      "Operaciones de Tarjetas": {
        "proposito": "Diagnóstico de problemas relacionados con el estado de las tarjetas, seguimiento del ciclo de vida.",
        "reporteria_bi": "Dashboards de operaciones, reportes de actividad de tarjetas."
      }
    }
  },
  "HET_CODTARJETA": {
    "descripcion": "Código único que identifica a la tarjeta cuyo estado ha cambiado. Clave foránea que referencia a la tabla de Tarjetas (asumiendo su existencia).",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Consultar el historial de cambios de estado de una tarjeta específica para brindar soporte al cliente.",
        "reporteria_bi": "Vistas de 360 grados del cliente, historial de tarjeta."
      },
      "Análisis de Fraude": {
        "proposito": "Identificar patrones de cambio de estado inusuales que puedan indicar actividad fraudulenta.",
        "reporteria_bi": "Reportes de alertas de fraude, dashboards de monitoreo."
      }
    }
  },
  "HET_FECHA_CAMBIO": {
    "descripcion": "Fecha y hora exacta en que se registró el cambio de estado de la tarjeta.",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Analizar la frecuencia y temporalidad de los cambios de estado, identificar tendencias.",
        "reporteria_bi": "Informes de actividad de tarjetas por periodo, análisis de churn (cambio de estado a inactivo)."
      },
      "Operaciones de Tarjetas": {
        "proposito": "Medir el tiempo de vida de los estados de la tarjeta y la eficiencia en los procesos de cambio de estado.",
        "reporteria_bi": "KPIs de gestión de tarjetas, reportes de duración de estados."
      }
    }
  },
  "HET_ESTADO_ANTERIOR": {
    "descripcion": "Estado previo de la tarjeta antes del cambio actual (ej., 'Activa', 'Bloqueada', 'Cancelada').",
    "usuarios_consumen": {
      "Auditoría y Compliance": {
        "proposito": "Verificar la secuencia correcta de los cambios de estado y asegurar que no haya saltos inesperados o no autorizados.",
        "reporteria_bi": "Registros de auditoría, reportes de trazabilidad de estado."
      },
      "Análisis de Fraude": {
        "proposito": "Estudiar la transición de estados para detectar patrones anómalos que precedan a fraudes.",
        "reporteria_bi": "Modelos de detección de anomalías, reportes de transiciones de estado sospechosas."
      }
    }
  },
  "HET_ESTADO_ACTUAL": {
    "descripcion": "Nuevo estado en el que se encuentra la tarjeta después del cambio registrado (ej., 'Activa', 'Bloqueada', 'Cancelada', 'Vencida').",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Conocer el estado actual de la tarjeta de un cliente para informar adecuadamente o realizar acciones pertinentes.",
        "reporteria_bi": "Vistas de 360 grados del cliente, sistemas de soporte al cliente."
      },
      "Marketing y Ventas": {
        "proposito": "Identificar tarjetas inactivas o canceladas para campañas de reactivación o retención.",
        "reporteria_bi": "Segmentación de clientes por estado de tarjeta, dashboards de ciclo de vida del cliente."
      }
    }
  },
  "TT_ID": {
    "descripcion": "Identificador único de cada transacción realizada con una tarjeta. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Conciliación de transacciones, auditoría de movimientos financieros.",
        "reporteria_bi": "Libros mayores, informes de conciliación."
      },
      "Desarrollo de Producto": {
        "proposito": "Análisis del uso de la tarjeta y patrones de gasto a nivel de transacción individual.",
        "reporteria_bi": "Detalle de transacciones, análisis granular de actividad."
      }
    }
  },
  "TT_CODTARJETA": {
    "descripcion": "Código único de la tarjeta que realizó la transacción. Clave foránea que referencia a la tabla de Tarjetas (asumiendo su existencia).",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Rastrear transacciones asociadas a una tarjeta específica para atender consultas o disputas.",
        "reporteria_bi": "Historial de transacciones de tarjeta, gestión de disputas."
      },
      "Análisis de Riesgos y Fraude": {
        "proposito": "Monitorear patrones de gasto por tarjeta para detectar comportamientos fraudulentos o de alto riesgo.",
        "reporteria_bi": "Alertas de fraude en tiempo real, perfiles de gasto por tarjeta."
      }
    }
  },
  "TT_FECHA": {
    "descripcion": "Fecha y hora exacta en que se registró la transacción.",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Analizar tendencias de gasto por períodos de tiempo, identificar picos y valles de actividad.",
        "reporteria_bi": "Informes de ventas por día/hora/mes, análisis de estacionalidad."
      },
      "Finanzas": {
        "proposito": "Proyecciones de flujo de efectivo basadas en el historial de transacciones.",
        "reporteria_bi": "Previsiones financieras, análisis de liquidez."
      }
    }
  },
  "TT_IMPORTE": {
    "descripcion": "Monto de la transacción realizada con la tarjeta.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Cálculo de ingresos, egresos y saldos de las cuentas de tarjeta.",
        "reporteria_bi": "Estados de cuenta, informes de ingresos/egresos."
      },
      "Marketing y Ventas": {
        "proposito": "Segmentación de clientes por volumen de gasto para campañas personalizadas o programas de fidelidad.",
        "reporteria_bi": "Segmentación de clientes por valor de vida (LTV), análisis de comportamiento de compra."
      }
    }
  },
  "TT_TIPO_TRANSACCION": {
    "descripcion": "Clasificación de la transacción (ej., 'Compra', 'Retiro en cajero', 'Devolución', 'Pago de servicios').",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Entender los tipos de uso de las tarjetas, identificar los servicios más utilizados o los patrones de gasto por categoría.",
        "reporteria_bi": "Dashboards de tipos de transacciones, análisis de servicios preferidos."
      },
      "Gestión de Fraude": {
        "proposito": "Identificar tipos de transacciones que son más propensas al fraude o que requieren mayor monitoreo.",
        "reporteria_bi": "Modelos de fraude específicos por tipo de transacción, alertas por transacciones inusuales."
      }
    }
  },
  "TT_ESTADO": {
    "descripcion": "Estado actual de la transacción (ej., 'Aprobada', 'Rechazada', 'Pendiente', 'Anulada').",
    "usuarios_consumen": {
      "Operaciones de Pagos": {
        "proposito": "Monitorear el procesamiento de las transacciones, identificar y resolver transacciones fallidas o pendientes.",
        "reporteria_bi": "Dashboards de transacciones en tiempo real, reportes de transacciones fallidas."
      },
      "Atención al Cliente": {
        "proposito": "Informar al cliente sobre el estado de sus transacciones y resolver disputas sobre cargos.",
        "reporteria_bi": "Historial de transacciones con estado, módulo de disputas."
      }
    }
  },
  "CT_ID": {
    "descripcion": "Identificador único de cada categoría de transacción. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Desarrollo de Producto": {
        "proposito": "Definir y gestionar las categorías que se utilizan para clasificar las transacciones.",
        "reporteria_bi": "Inventario de categorías, herramientas de configuración."
      }
    }
  },
  "CT_NOMBRE": {
    "descripcion": "Nombre descriptivo de la categoría de la transacción (ej., 'Alimentos y Bebidas', 'Transporte', 'Entretenimiento').",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Analizar patrones de gasto por categoría para entender el comportamiento del consumidor y diseñar ofertas.",
        "reporteria_bi": "Reportes de gasto por categoría, dashboards de comportamiento de cliente."
      },
      "Marketing": {
        "proposito": "Crear campañas personalizadas basadas en las categorías de gasto de los clientes.",
        "reporteria_bi": "Segmentación de clientes por preferencias de gasto, análisis de impacto de campañas."
      }
    }
  },
  "CT_DESCRIPCION": {
    "descripcion": "Descripción detallada de la categoría, explicando qué tipo de transacciones incluye.",
    "usuarios_consumen": {
      "Equipo de Datos y BI": {
        "proposito": "Asegurar la consistencia y el entendimiento de las categorías al momento de desarrollar informes y dashboards.",
        "reporteria_bi": "Documentación interna, glosario de términos de negocio."
      }
    }
  },
  "PT_ID": {
    "descripcion": "Identificador único de cada pago realizado a una tarjeta. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Conciliación de pagos, seguimiento de ingresos.",
        "reporteria_bi": "Informes de pagos recibidos, dashboards de ingresos."
      }
    }
  },
  "PT_CODTARJETA": {
    "descripcion": "Código único de la tarjeta a la que se aplicó el pago. Clave foránea que referencia a la tabla de Tarjetas (asumiendo su existencia).",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Consultar los pagos realizados por un cliente en una tarjeta específica.",
        "reporteria_bi": "Historial de pagos del cliente, estado de cuenta."
      }
    }
  },
  "PT_FECHA_PAGO": {
    "descripcion": "Fecha y hora en que se registró el pago de la tarjeta.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Análisis de la puntualidad de los pagos, proyecciones de flujo de caja entrante.",
        "reporteria_bi": "Reportes de morosidad, análisis de plazos de pago."
      },
      "Cobranzas": {
        "proposito": "Monitorear la efectividad de las campañas de cobranza y la recuperación de deuda.",
        "reporteria_bi": "Dashboards de gestión de cobranza, reportes de recuperación."
      }
    }
  },
  "PT_IMPORTE": {
    "descripcion": "Monto del pago realizado a la tarjeta.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Contabilidad de los pagos recibidos, cálculo de saldos pendientes.",
        "reporteria_bi": "Informes de ingresos por pagos, conciliaciones bancarias."
      },
      "Atención al Cliente": {
        "proposito": "Verificar los montos pagados para resolver disputas o dudas del cliente.",
        "reporteria_bi": "Estado de cuenta del cliente, detalle de pagos."
      }
    }
  },
  "PT_METODO_PAGO": {
    "descripcion": "Método utilizado para realizar el pago (ej., 'Transferencia bancaria', 'Tarjeta de débito', 'Pago en efectivo', 'Débito automático').",
    "usuarios_consumen": {
      "Operaciones de Pagos": {
        "proposito": "Optimizar los canales de pago más utilizados, identificar fricciones en métodos específicos.",
        "reporteria_bi": "Análisis de canales de pago, KPIs de eficiencia de pago."
      },
      "Finanzas": {
        "proposito": "Análisis de costes asociados a cada método de pago.",
        "reporteria_bi": "Reportes de costos operativos por método de pago."
      }
    }
  },
  "PT_ESTADO": {
    "descripcion": "Estado actual del pago (ej., 'Procesado', 'Pendiente', 'Rechazado', 'Revertido').",
    "usuarios_consumen": {
      "Operaciones de Pagos": {
        "proposito": "Monitorear el flujo de pagos, identificar y resolver problemas en el procesamiento.",
        "reporteria_bi": "Dashboards de estado de pagos, alertas de pagos fallidos."
      },
      "Atención al Cliente": {
        "proposito": "Informar al cliente sobre el estado de sus pagos y gestionar incidencias.",
        "reporteria_bi": "Consulta de estado de pagos, gestión de reclamos."
      }
    }
  },
  "TC_ID": {
    "descripcion": "Identificador único de la relación muchos a muchos entre una transacción y una categoría. Clave primaria de la tabla de unión.",
    "usuarios_consumen": {
      "Equipo de Datos y BI": {
        "proposito": "Facilitar la unión entre transacciones y categorías para análisis y reportería.",
        "reporteria_bi": "Modelado de datos, diseño de ETL."
      }
    }
  },
  "TT_ID": {
    "descripcion": "Identificador de la transacción, clave foránea que referencia a la tabla 'TRANSACCION TARJETA'.",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Permite vincular cada transacción a sus categorías correspondientes para análisis de gasto detallado.",
        "reporteria_bi": "Reportes de gasto por categoría a nivel de transacción, análisis granular."
      }
    }
  },
  "CT_ID": {
    "descripcion": "Identificador de la categoría, clave foránea que referencia a la tabla 'CATEGORIAS TRANSACCION'.",
    "usuarios_consumen": {
      "Marketing": {
        "proposito": "Utilizar la categorización para segmentar clientes en base a sus preferencias de gasto y crear ofertas relevantes.",
        "reporteria_bi": "Segmentación de clientes, personalización de ofertas."
      }
    }
  },
  "LCT_ID": {
    "descripcion": "Identificador único de cada registro en el historial de límites de crédito de una tarjeta. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Auditoría y Compliance": {
        "proposito": "Rastrear los cambios en los límites de crédito para cumplir con las regulaciones y políticas internas.",
        "reporteria_bi": "Informes de auditoría de límites, trazabilidad de ajustes."
      }
    }
  },
  "LCT_CODTARJETA": {
    "descripcion": "Código único de la tarjeta cuyo límite de crédito ha sido ajustado. Clave foránea que referencia a la tabla de Tarjetas.",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Consultar el historial de ajustes de límite de crédito para una tarjeta específica.",
        "reporteria_bi": "Historial de límites de crédito, vista 360 del cliente."
      },
      "Análisis de Riesgo": {
        "proposito": "Evaluar el comportamiento del cliente en relación con los cambios en su límite de crédito.",
        "reporteria_bi": "Análisis de uso de crédito vs. límite, reportes de riesgo por segmento."
      }
    }
  },
  "LCT_FECHA": {
    "descripcion": "Fecha y hora en que se registró el ajuste del límite de crédito.",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Analizar la frecuencia y motivos de los ajustes de límite, y su impacto en el comportamiento de gasto.",
        "reporteria_bi": "Informes de ajustes de límite por período, análisis de respuesta de clientes."
      }
    }
  },
  "LCT_IMPORTE": {
    "descripcion": "Nuevo valor del límite de crédito después del ajuste.",
    "usuarios_consumen": {
      "Gestión de Cartera de Crédito": {
        "proposito": "Monitorear la exposición al crédito a nivel de cliente y de cartera.",
        "reporteria_bi": "Reportes de exposición crediticia, dashboards de límite de crédito utilizado."
      },
      "Finanzas": {
        "proposito": "Proyecciones de riesgo y oportunidad basadas en la gestión de límites de crédito.",
        "reporteria_bi": "Análisis de capital, modelos de riesgo crediticio."
      }
    }
  },
  "LCT_TIPO_AJUSTE": {
    "descripcion": "Tipo de ajuste realizado al límite de crédito (ej., 'Aumento', 'Disminución', 'Renovación').",
    "usuarios_consumen": {
      "Análisis de Riesgo": {
        "proposito": "Entender las razones detrás de los cambios en los límites y su correlación con el comportamiento de pago y riesgo.",
        "reporteria_bi": "Reportes de ajustes por tipo, análisis de impacto de los ajustes."
      },
      "Marketing y Ventas": {
        "proposito": "Identificar oportunidades para ofrecer aumentos de límite a clientes de bajo riesgo.",
        "reporteria_bi": "Segmentación de clientes para ofertas de límite, campañas de cross-selling."
      }
    }
  },
  "LCT_ESTADO": {
    "descripcion": "Estado del registro del ajuste de límite (ej., 'Aplicado', 'Pendiente', 'Rechazado', 'Anulado').",
    "usuarios_consumen": {
      "Operaciones de Tarjetas": {
        "proposito": "Monitorear el procesamiento de las solicitudes de ajuste de límite y resolver problemas.",
        "reporteria_bi": "Dashboards de solicitudes de límite, reportes de eficiencia de procesamiento."
      }
    }
  },
  "RT_ID": {
    "descripcion": "Identificador único de cada recompensa o beneficio otorgado a una tarjeta. Clave primaria de la tabla.",
    "usuarios_consumen": {
      "Marketing y Fidelización": {
        "proposito": "Auditar la emisión de recompensas y asegurar la correcta asignación.",
        "reporteria_bi": "Informes de recompensas emitidas, trazabilidad de beneficios."
      }
    }
  },
  "RT_CODTARJETA": {
    "descripcion": "Código único de la tarjeta que recibió la recompensa. Clave foránea que referencia a la tabla de Tarjetas.",
    "usuarios_consumen": {
      "Atención al Cliente": {
        "proposito": "Consultar las recompensas obtenidas por un cliente en su tarjeta.",
        "reporteria_bi": "Historial de recompensas del cliente, estado de cuenta de puntos/beneficios."
      },
      "Marketing y Fidelización": {
        "proposito": "Analizar la participación de las tarjetas en programas de recompensa y su impacto en la retención.",
        "reporteria_bi": "Dashboards de participación en programas, análisis de cliente activo."
      }
    }
  },
  "RT_FECHA": {
    "descripcion": "Fecha y hora en que se otorgó la recompensa.",
    "usuarios_consumen": {
      "Análisis de Negocio": {
        "proposito": "Analizar la estacionalidad y el impacto de las campañas de recompensas.",
        "reporteria_bi": "Informes de recompensas por periodo, análisis de eficacia de campañas."
      }
    }
  },
  "RT_TIPO_RECOMPENSA": {
    "descripcion": "Tipo de recompensa otorgada (ej., 'Puntos de fidelidad', 'Cashback', 'Millas', 'Descuento').",
    "usuarios_consumen": {
      "Marketing y Fidelización": {
        "proposito": "Evaluar la popularidad y el impacto de diferentes tipos de recompensas en el comportamiento del cliente.",
        "reporteria_bi": "Análisis de preferencia de recompensas, modelos de atribución de recompensas."
      },
      "Finanzas": {
        "proposito": "Calcular la provisión y el coste asociado a los diferentes programas de recompensas.",
        "reporteria_bi": "Informes de pasivos por recompensas, análisis de costos de programas."
      }
    }
  },
  "RT_VALOR": {
    "descripcion": "Valor monetario o en puntos de la recompensa otorgada.",
    "usuarios_consumen": {
      "Finanzas": {
        "proposito": "Monitorear el coste total de los programas de recompensas y su rentabilidad.",
        "reporteria_bi": "Reportes de gasto en recompensas, análisis de ROI de programas de fidelización."
      },
      "Marketing y Fidelización": {
        "proposito": "Optimizar el valor de las recompensas para maximizar el engagement del cliente y la rentabilidad.",
        "reporteria_bi": "Modelado de valor de recompensa, análisis de redención."
      }
    }
  },
  "RT_ESTADO": {
    "descripcion": "Estado actual de la recompensa (ej., 'Canjeada', 'Pendiente', 'Expirada', 'Anulada').",
    "usuarios_consumen": {
      "Operaciones de Recompensas": {
        "proposito": "Monitorear el ciclo de vida de las recompensas, gestionar canjes y resolver incidencias.",
        "reporteria_bi": "Dashboards de estado de recompensas, reportes de redención."
      },
      "Atención al Cliente": {
        "proposito": "Informar al cliente sobre el estado de sus recompensas y ayudar en el proceso de canje.",
        "reporteria_bi": "Consulta de recompensas disponibles y canjeadas."
      }
    }
  }
}